# Задайте список из n чисел последовательности (1 +1%n) и выведите на экран их сумму.
n = int(input())
s = 0
for i in range(1, n + 1):
    s += (1 + 1 / i) ** i
print(s)    