# Напишите программу которая принимает на вход вещественное число и показывает сумму его цифр.
n = input()
s = 0
for el in n:
    if el != '.':
        s += int(el)
print(s)        